[
    {   
        "id": 1,
        "name": "Landing page",
        "img": "./Portfolio/img/firrstProject.png",
        "description": "During the development of the project I have used HTML, CSS, JS worked with DOM, it's my first step project",
        "siteLink": "https://s1lenc1995.github.io/step_project1/",
        "codeLink": "https://github.com/S1lenc1995/step_project1"
    },
    {
        "id": 2,
        "name": "Adaptive design",
        "img": "./Portfolio/img/SecondProject.png",
        "description": "During the development of the project I have used HTML using semantic tags, BEM class naming methodology, Mobile first, Adaptive and responsive design, Flexbox, Grid, Css preprocessor SASS SCSS, Media query, Variables, Mixin, NPM and its modules, the project was compiled using Gulp",
        "siteLink": "https://s1lenc1995.github.io/step_project2/",
        "codeLink": "https://github.com/S1lenc1995/step_project2"
    },
    {   
        "id": 3,
        "name": "Cinema",
        "img": "./Portfolio/img/Cinema.png",
        "description": "During the development of the project I have used React, Router, Redux, React hooks, Fetch requests. In this app you can add any films like favorites films and it will help you will not forget them. Also you can read informatiom about some film  ",
        "siteLink": "https://s1lenc1995.github.io/cinema/",
        "codeLink": "https://github.com/S1lenc1995/cinema"
    },
    {   
        "id": 4,
        "name": "Tasks manager",
        "img": "./Portfolio/img/Task_app.png",
        "description": "For experionse in this app I have used React Context and it helped me to understand more about React. In this app you can add any your tasks, also you can edit, remove, add to main and tick if you finished some task. You can see percentage of uncompleted tasks. I hope it is going to help you will not forget your tasks",
        "siteLink": "https://s1lenc1995.github.io/tasks-app/",
        "codeLink": "https://github.com/S1lenc1995/tasks-app"
    },
    {   
        "id": 5,
        "name": "Coffee time",
        "img": "./Portfolio/img/coffee_time.png",
        "description": "In this project I used React, Redux, React routers, Formik, and you can chose coffee machine and add to favorites or to basket and after create your order",
        "siteLink": "https://s1lenc1995.github.io/Coffee_time/",
        "codeLink": "https://github.com/S1lenc1995/Coffee_time"
    }
]

